[{"FeedTitle":"Blog – AI Impacts","ItemTitle":"What do ML researchers think about AI in 2022?","Link":"http://aiimpacts.org/what-do-ml-researchers-think-about-ai-in-2022/","Description":"Katja Grace Aug 4 2022\n\nFirst findings from the new 2022 Expert Survey on Progress in AI. ","Published":"2022-08-04T15:37:41Z"},{"FeedTitle":"Jonathan Kohl","ItemTitle":"New Book Published: Tap Into Mobile Application Design","Link":"http://www.kohl.ca/2022/new-book-published-tap-into-mobile-application-design/","Description":"After a long delay due to some health issues, I have finally finished the first version of Tap Into Mobile Application Design. This book is only available in PDF and epub electronic formats which should work on most e-reader apps on most mobile devices. I used Leanpub as the publishing platform, as with Tap Into … Continue reading New Book Published: Tap Into Mobile Application Design →","Published":"2022-08-03T15:03:02Z"},{"FeedTitle":"Junk Charts","ItemTitle":"Four numbers, not as easy as it seems","Link":"https://junkcharts.typepad.com/junk_charts/2022/08/four-numbers-not-as-easy-as-it-seems.html","Description":"Kaiser shows a chart with four numbers.","Published":"2022-08-03T13:40:00Z"},{"FeedTitle":"Blog","ItemTitle":"Improve Testing Collaboration with Enhanced Branching and Version Control | mabl","Link":"https://www.mabl.com/blog/improve-testing-collaboration-with-enhanced-branching-and-version-control-mabl","Description":" \n    \n \nDevOps is designed to unlock faster, higher quality software development through best practices that help developers continuously build, experiment, and collaborate on new code. But as useful as practices like branching, conflict resolution, and peer review are when accelerating product velocity, they have remained almost exclusive to those with coding experience. Limitations imposed by code-heavy development and test automation tools have created inefficient silos that inhibit quality teams and developers from working together to build iterative development pipelines that produce high-quality software. ","Published":"2022-08-03T12:00:00Z"},{"FeedTitle":"Hiccupps","ItemTitle":"Enjoy Testing","Link":"https://qahiccupps.blogspot.com/2022/07/enjoy-testing.html","Description":"","Published":"2022-07-30T17:15:00.005Z"},{"FeedTitle":"WebAIM Blog","ItemTitle":"Tips for Getting the Most Out of WAVE","Link":"https://webaim.org/blog/tips-for-getting-the-most-out-of-wave/","Description":"As WebAIM has developed the WAVE accessibility evaluation tool over the years, many of our improvements have been driven by our own evaluation work. Here are some “power user” tips I use to get the most out of WAVE. Note: This article is for those who are already familiar with WAVE. If you are somewhat […]","Published":"2022-07-28T21:04:36Z"},{"FeedTitle":"A Seasoned Tester's Crystal Ball","ItemTitle":"Language change in Gherkin Experiment","Link":"https://visible-quality.blogspot.com/2022/07/language-change-in-gherkin-experiment.html","Description":"","Published":"2022-07-28T13:23:00.003Z"},{"FeedTitle":"axbom","ItemTitle":"Algo-free behavior","Link":"https://axbom.com/ethics-of-character/","Description":"This is the first newsletter sent from my self-hosted Ghost installation with absolutely no tracking of clicks and opens. It’s embarassing to admit how long it often takes me to put my money where my mouth is, to actually work in alignment with the responsible innovation I teach.","Published":"2022-07-26T15:45:13Z"}]